randop/VibeThing/stm32/freertos/main.cpp
#include "main.h"
#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>

#if defined STM32F1
#include <stm32f1xx_hal.h>

// STM32VL-Discovery green led - PC9
#define LED_PORT GPIOC
#define LED_PIN GPIO_PIN_9
// STM32VL-Discovery blue led - PC8
// #define LED_PIN                 GPIO_PIN_8

// Blue Pill (STM32F103C8T6) onboard green led - PC13 (active-low)
#define LED_PIN GPIO_PIN_13

#define LED_PORT_CLK_ENABLE __HAL_RCC_GPIOC_CLK_ENABLE
#elif defined STM32H7
#include <stm32h7xx_hal.h>

// STM32H743ZI blue LED
#define LED_PORT GPIOB
#define LED_PIN GPIO_PIN_7
#define LED_PORT_CLK_ENABLE __HAL_RCC_GPIOB_CLK_ENABLE
#elif defined STM32F4
#include <stm32f4xx_hal.h>

// STM32F4-Discovery green led - PD12
#define LED_PORT GPIOD
#define LED_PIN GPIO_PIN_12
#define LED_PORT_CLK_ENABLE __HAL_RCC_GPIOD_CLK_ENABLE
#elif defined STM32L5
#include <stm32l5xx_hal.h>

// NUCLEO-L552ZE-Q blue led - PB7
#define LED_PORT GPIOB
#define LED_PIN GPIO_PIN_7
#define LED_PORT_CLK_ENABLE __HAL_RCC_GPIOB_CLK_ENABLE
#endif

static void blinky::simpleBlink(void *arg) {
  for (;;) {
    vTaskDelay(10000);
    HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
  }
}

static void blinky::blinkTask(void *arg) {
  (void)arg;

  // Important for Blue Pill / STM32F103C8T6 clones:
  // The onboard LED is on PC13 and active-low (RESET = ON, SET = OFF).

  const GPIO_PinState LED_ON = GPIO_PIN_RESET; // Active-low
  const GPIO_PinState LED_OFF = GPIO_PIN_SET;

  // Start with LED off
  HAL_GPIO_WritePin(LED_PORT, LED_PIN, LED_OFF);

  const TickType_t delay_5s = pdMS_TO_TICKS(5000);
  const TickType_t delay_10s = pdMS_TO_TICKS(10000);
  const TickType_t delay_15s = pdMS_TO_TICKS(15000);
  const TickType_t delay_fast = pdMS_TO_TICKS(100);
  const TickType_t delay_1s = pdMS_TO_TICKS(1000);
  const TickType_t delay_3s = pdMS_TO_TICKS(3000);
  const TickType_t delay_tail = pdMS_TO_TICKS(500);

  // Number of fast toggles
  const uint8_t fast_blink_count = 50;

  for (;;) {
    // Solid ON for 5 seconds
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, LED_ON);
    vTaskDelay(delay_5s);

    HAL_GPIO_WritePin(LED_PORT, LED_PIN, LED_OFF);
    vTaskDelay(delay_1s);

    // Fast blinking
    for (uint8_t i = 0; i < fast_blink_count; ++i) {
      HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
      vTaskDelay(delay_fast);
    }

    // Optional: explicitly ensure OFF before next long ON
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, LED_OFF);
    vTaskDelay(delay_tail);
  }
}

void blinky::init() {
  GPIO_InitTypeDef GPIO_Config;

  GPIO_Config.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_Config.Pull = GPIO_NOPULL;
  GPIO_Config.Speed = GPIO_SPEED_FREQ_LOW;

  GPIO_Config.Pin = LED_PIN;

  LED_PORT_CLK_ENABLE();
  HAL_GPIO_Init(LED_PORT, &GPIO_Config);
}

int main(void) {
  SystemInit();
  blinky::init();

  xTaskCreate(blinky::blinkTask, "blinky", configMINIMAL_STACK_SIZE, NULL,
              tskIDLE_PRIORITY + 1, NULL);

  vTaskStartScheduler();
  for (;;) {
    /** main loop **/
  }

  return 0;
}

extern "C" void vApplicationTickHook(void) {}

extern "C" void vApplicationIdleHook(void) {}

extern "C" void vApplicationMallocFailedHook(void) {
  taskDISABLE_INTERRUPTS();
  for (;;)
    ;
}

extern "C" void vApplicationStackOverflowHook(TaskHandle_t pxTask,
                                              char *pcTaskName) {
  (void)pcTaskName;
  (void)pxTask;

  taskDISABLE_INTERRUPTS();
  for (;;)
    ;
}
